## 🏗️ Azure Terraform Plan - dev

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.OperationalInsights/workspaces/databro-dev-logs]
azurerm_container_registry.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.ContainerRegistry/registries/databrodevacr]
azurerm_storage_account.app_data: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.Storage/storageAccounts/databrodevst]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env]
azurerm_container_app.llm_service: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/llm-service]
azurerm_container_app.api_gateway: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/api-gateway]
azurerm_storage_container.rag_state: Refreshing state... [id=https://databrodevst.blob.core.windows.net/rag-state]
azurerm_container_app.speech_service: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/speech-service]
azurerm_container_app.rag_service: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/rag-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.api_gateway will be updated in-place
  ~ resource "azurerm_container_app" "api_gateway" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/api-gateway"
        name                          = "api-gateway"
        tags                          = {}
        # (9 unchanged attributes hidden)

      + registry {
          + password_secret_name = "acr-password"
          + server               = "databrodevacr.azurecr.io"
          + username             = "databrodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "mcr.microsoft.com/k8se/quickstart:latest" -> "databrodevacr.azurecr.io/api-gateway:latest"
              ~ memory            = "1Gi" -> "1.0Gi"
                name              = "api-gateway"
                # (4 unchanged attributes hidden)

              + env {
                  + name  = "SPEECH_SERVICE_URL"
                  + value = "http://speech-service"
                }

                # (2 unchanged blocks hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # azurerm_container_app.llm_service will be updated in-place
  ~ resource "azurerm_container_app" "llm_service" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/llm-service"
        name                          = "llm-service"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ memory            = "4Gi" -> "4.0Gi"
                name              = "ollama"
                # (5 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.rag_service will be updated in-place
  ~ resource "azurerm_container_app" "rag_service" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/rag-service"
        name                          = "rag-service"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ memory            = "2Gi" -> "2.0Gi"
                name              = "rag-service"
                # (5 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_container_app.speech_service will be updated in-place
  ~ resource "azurerm_container_app" "speech_service" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/speech-service"
        name                          = "speech-service"
        tags                          = {}
        # (9 unchanged attributes hidden)

      + registry {
          + password_secret_name = "acr-password"
          + server               = "databrodevacr.azurecr.io"
          + username             = "databrodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "mcr.microsoft.com/k8se/quickstart:latest" -> "databrodevacr.azurecr.io/speech-service:latest"
              ~ memory            = "2Gi" -> "2.0Gi"
                name              = "speech-service"
                # (4 unchanged attributes hidden)

              + env {
                  + name        = "AZURE_STORAGE_CONNECTION_STRING"
                  + secret_name = "storage-connection-string"
                }
              + env {
                  + name  = "AUDIO_CONTAINER_NAME"
                  + value = "public-audio"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_container.public_audio will be created
  + resource "azurerm_storage_container" "public_audio" {
      + container_access_type             = "blob"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "public-audio"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "databrodevst"
    }

Plan: 1 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

**Plan Status**: success
**Validation**: success
**Format**: failure